## 1

In [1]:
import pandas as pd #importing pandas library as pd

In [2]:
myDF = pd.read_csv("/anvil/projects/tdm/data/death_records/DeathRecords.csv") #Reading the dataset

In [3]:
myDF.head() #to see the heading of the dataset

,Id,ResidentStatus,Education1989Revision,Education2003Revision,EducationReportingFlag,MonthOfDeath,Sex,AgeType,Age,AgeSubstitutionFlag,...,CauseRecode39,NumberOfEntityAxisConditions,NumberOfRecordAxisConditions,Race,BridgedRaceFlag,RaceImputationFlag,RaceRecode3,RaceRecode5,HispanicOrigin,HispanicOriginRaceRecode
0,1,1,0,2,1,1,M,1,87,0,...,24,1,1,1,0,0,1,1,100,6
1,2,1,0,2,1,1,M,1,58,0,...,21,3,3,1,0,0,1,1,100,6
2,3,1,0,7,1,1,F,1,75,0,...,28,2,2,1,0,0,1,1,100,6
3,4,1,0,6,1,1,M,1,74,0,...,22,3,3,1,0,0,1,1,100,6
4,5,1,0,3,1,1,M,1,64,0,...,21,1,1,1,0,0,1,1,100,6

In [4]:
myDF.groupby('Sex')['Age'].mean() #to find the mean age of death by gender

Sex
F    76.676685
M    70.227858
Name: Age, dtype: float64

## 2

In [5]:
import pandas as pd #importing pandas library as pd

In [6]:
#reading the csv file and giving the columns the heading

In [7]:
myDF= pd.read_csv("/anvil/projects/tdm/data/8451/The_Complete_Journey_2_Master/5000_transactions.csv")

In [8]:
myDF.columns = ["BASKET_NUM", "HSHD_NUM", "PURCHASE", "PRODUCT_NUM", "SPEND", "UNITS", "STORE_R", "WEEK_NUM", "YEAR"]

In [9]:
myDF.head() #printing the data

,BASKET_NUM,HSHD_NUM,PURCHASE,PRODUCT_NUM,SPEND,UNITS,STORE_R,WEEK_NUM,YEAR
0,24,1809,03-JAN-16,5817389,-1.50,-1,SOUTH,1,2016
1,24,1809,03-JAN-16,5829886,-1.50,-1,SOUTH,1,2016
2,34,1253,03-JAN-16,539501,2.19,1,EAST,1,2016
3,60,1595,03-JAN-16,5260099,0.99,1,WEST,1,2016
4,60,1595,03-JAN-16,4535660,2.50,2,WEST,1,2016

In [10]:
myDF.groupby('PRODUCT_NUM')['SPEND'].sum().sort_values().tail(10)
#to find the total amount of money spent on each PRODUCT_NUM in order of top 10 types

PRODUCT_NUM
89415       50032.42
8523        53845.65
1344763     58170.84
4889358     63823.61
85201       65605.34
766108      66085.00
74424       75787.49
85311      102928.59
1367192    111433.78
8511       131399.78
Name: SPEND, dtype: float64

## 3

In [11]:
myDF=pd.read_csv("/anvil/projects/tdm/data/beer/reviews_sample.csv")

In [12]:
myDF.head()

,beer_id,username,date,text,look,smell,taste,feel,overall,score
0,271781,bluejacket74,2017-03-17,"750 ml bottle, 2016 vintage, bottle #304 of...",4.00,4.00,4.00,4.25,4.00,4.03
1,125646,_dirty_,2017-12-21,,4.50,4.50,4.50,4.50,4.50,4.50
2,125646,CJDUBYA,2017-12-21,,4.75,4.75,4.75,4.75,4.75,4.75
3,125646,GratefulBeerGuy,2017-12-20,0% 16 oz can. Funny story: As I finally wal...,4.75,4.75,4.50,4.50,4.50,4.58
4,125646,LukeGude,2017-12-20,Classic TH NEIPA. Overflowing head and bouq...,4.25,4.50,4.25,4.25,4.25,4.31

In [13]:
myDF.groupby('date')['score'].mean().sort_values().tail(3) 
#Show the three dates on which the mean score is a 5

date
2001-04-26    5.0
2001-06-18    5.0
2002-01-26    5.0
Name: score, dtype: float64

## 4

In [14]:
myDF=pd.read_csv("/anvil/projects/tdm/data/election/itcont1980.txt", header=None, sep='|')
#read the file

In [15]:
myDF.columns = ["CMTE_ID", "AMNDT_IND", "RPT_TP", "TRANSACTION_PGI", "IMAGE_NUM", "TRANSACTION_TP", "ENTITY_TP", "NAME", "CITY", "STATE", "ZIP_CODE", "EMPLOYER", "OCCUPATION", "TRANSACTION_DT", "TRANSACTION_AMT", "OTHER_ID", "TRAN_ID", "FILE_NUM", "MEMO_CD", "MEMO_TEXT", "SUB_ID"]
#specifying the column name

In [16]:
myDF.head() #printing the data from the file

,CMTE_ID,AMNDT_IND,RPT_TP,TRANSACTION_PGI,IMAGE_NUM,TRANSACTION_TP,ENTITY_TP,NAME,CITY,STATE,...,EMPLOYER,OCCUPATION,TRANSACTION_DT,TRANSACTION_AMT,OTHER_ID,TRAN_ID,FILE_NUM,MEMO_CD,MEMO_TEXT,SUB_ID
0,C00078279,A,M11,P,80031492155,22Y,NaN,"MCKENNON, K R",MIDLAND,MI,...,NaN,NaN,10031979.0,400,NaN,NaN,NaN,NaN,CONTRIBUTION REF TO INDIVIDUAL,3062020110011466469
1,C00078279,A,M11,NaN,79031415137,15,NaN,"OREFFICE, P",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,1500,NaN,NaN,NaN,NaN,NaN,3061920110000382948
2,C00078279,A,M11,NaN,79031415137,15,NaN,"DOWNEY, J",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,300,NaN,NaN,NaN,NaN,NaN,3061920110000382949
3,C00078279,A,M11,NaN,79031415137,15,NaN,"BLAIR, E",MIDLAND,MI,...,DOW CHEMICAL CO,NaN,10261979.0,1000,NaN,NaN,NaN,NaN,NaN,3061920110000382950
4,C00078287,A,Q1,NaN,79031231889,15,NaN,"BLANCHARD, JOHN A",CHICAGO,IL,...,NaN,NaN,3201979.0,200,NaN,NaN,NaN,NaN,NaN,3061920110000383914

In [17]:
#printing the top 20 city-and-state pairs, as well as the missing values, according to the amount of money donated.

In [18]:
myDF.groupby(myDF['CITY'] + ','+ myDF['STATE'], dropna = False)['TRANSACTION_AMT'].sum().sort_values().tail(21)

NEW ORLEANS,LA        912896
CINCINNATI,OH        1096983
DENVER,CO            1183471
MIDLAND,TX           1210584
WASHINGTOM,DC        1300341
GREENWICH,CT         1340112
TULSA,OK             1341956
MIAMI,FL             1541867
SAN ANTONIO,TX       1583292
ST LOUIS,MO          1639570
OKLAHOMA CITY,OK     1751431
ATLANTA,GA           1892056
BEVERLY HILLS,CA     2053148
SAN FRANCISCO,CA     2061441
CHICAGO,IL           3179170
WASHINGTON,DC        4273606
LOS ANGELES,CA       4569952
DALLAS,TX            4747262
HOUSTON,TX           7606806
NEW YORK,NY         11344277
NaN                 18092711
Name: TRANSACTION_AMT, dtype: int64

## 5

In [1]:
import pandas as pd

In [2]:
myDF = pd.read_csv("/anvil/projects/tdm/data/flights/subset/1990.csv")

In [3]:
myDF.head()

,Year,Month,DayofMonth,DayOfWeek,DepTime,CRSDepTime,ArrTime,CRSArrTime,UniqueCarrier,FlightNum,...,TaxiIn,TaxiOut,Cancelled,CancellationCode,Diverted,CarrierDelay,WeatherDelay,NASDelay,SecurityDelay,LateAircraftDelay
0,1990,1,3,3,1707.0,1630,1755.0,1723,US,29,...,NaN,NaN,0,NaN,0,NaN,NaN,NaN,NaN,NaN
1,1990,1,4,4,1706.0,1630,1807.0,1723,US,29,...,NaN,NaN,0,NaN,0,NaN,NaN,NaN,NaN,NaN
2,1990,1,5,5,1629.0,1630,1715.0,1723,US,29,...,NaN,NaN,0,NaN,0,NaN,NaN,NaN,NaN,NaN
3,1990,1,6,6,1633.0,1630,1718.0,1723,US,29,...,NaN,NaN,0,NaN,0,NaN,NaN,NaN,NaN,NaN
4,1990,1,8,1,1630.0,1630,1726.0,1723,US,29,...,NaN,NaN,0,NaN,0,NaN,NaN,NaN,NaN,NaN

In [4]:
#to Show the worst 6 dates from 1990, according to the largest mean departure 
#delay (DepDelay) values. we had to tell that it is a string.

In [5]:
myDF.groupby(myDF['Month'].astype(str) + '/' + myDF['DayofMonth'].astype(str) + '/' + myDF['Year'].astype(str))['DepDelay'].mean().sort_values().tail(6)

12/20/1990    27.345403
2/15/1990     28.123023
2/16/1990     36.194221
12/28/1990    43.914432
12/22/1990    45.222249
12/21/1990    45.661782
Name: DepDelay, dtype: float64